<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Dolibarr Installation: Installation</TITLE>
 <LINK HREF="dolibarr-install-2.html" REL=next>

 <LINK HREF="dolibarr-install.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="dolibarr-install-2.html">Page suivante</A>
Page précédente
<A HREF="dolibarr-install.html#toc1">Table des matières</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="dolibarr-install.html#toc1">Installation</A></H2>

<H2><A NAME="ss1.1">1.1</A> <A HREF="dolibarr-install.html#toc1.1">R&eacute;cup&eacute;rer les sources</A>
</H2>

<P>R&eacute;cup&eacute;rer les sources sur 
<A HREF="http://www.dolibarr.com/">http://www.dolibarr.com/</A></P>
<P>Les sources se pr&eacute;sentent sous la forme d'un fichier tar compress&eacute; avec gzip.</P>
<H2><A NAME="ss1.2">1.2</A> <A HREF="dolibarr-install.html#toc1.2">Pr&eacute;-requis</A>
</H2>

<P>Liste des logiciels &agrave; installer pour faire fonctionner Dolibarr :</P>
<P>
<UL>
<LI>php4</LI>
<LI>php4-mysql</LI>
<LI>php4-curl (pour la partie gestion des adh&eacute;rents)</LI>
<LI>Apache</LI>
</UL>

Pour la gestion de l'authentification, Dolibarr fonctionne soit avec mod-auth-mysql soit avec Pear. Cette derni&egrave;re est plus facile &agrave; installer.
<UL>
<LI>Pear (package Auth)</LI>
<LI>libapache-mod-auth-mysql</LI>
</UL>
</P>
<H3>Pear</H3>

<P>Pear est un ensemble de classes et d'outils pour les installer et les mettre &agrave; jour. Les classes requises pour Dolibarr sont (par ordre d'installation) :</P>
<P>
<UL>
<LI>Archive_Tar</LI>
<LI>Console_Getopt</LI>
<LI>PEAR</LI>
<LI>Auth</LI>
<LI>DB</LI>
</UL>
</P>
<P>Pour installer un paquet Pear, ex&eacute;cutez en root '$ pear install &lt;nom du paquet&gt;'.</P>
<P>Pour plus d'informations sur Pear et sa configuration, veuillez vous reporter &agrave; son site officiel 
<A HREF="pear.php.net">pear.php.net</A>.</P>
<H2><A NAME="ss1.3">1.3</A> <A HREF="dolibarr-install.html#toc1.3">Base de donn&eacute;es</A>
</H2>

<P>1- cr&eacute;er une base de donn&eacute;es mysql appel&eacute;e 'dolibarr' (vous
pouvez changer le nom, dans ce cas remplacer dans la suite des
commandes 'dolibarr' par le nom de votre base de donn&eacute;es)</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        # mysqladmin create dolibarr
   
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>     
2- charger la base en ex&eacute;cutant :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        # mysql dolibarr &lt; mysql/mysql.sql
   
</PRE>
</CODE></BLOCKQUOTE>
</P>
<H2><A NAME="ss1.4">1.4</A> <A HREF="dolibarr-install.html#toc1.4">Apache</A>
</H2>

<P>Pour configurer Apache : des fichier httpd.conf.dist est fournit
avec les sources, vous pouvez vous en servir pour configurer
votre serveur, il est pr&eacute;vu pour que vous ayez juste &agrave; ajouter
une r&eacute;gle Include dans votre fichier principal httpd.conf.</P>
<P>Utilisez le fichier httpd.conf.dist pour l'authentification par Pear (conseill&eacute;) et le fichier httpd.conf.dist.modauth pour utiliser mod-auth-mysql.</P>
<H2><A NAME="ss1.5">1.5</A> <A HREF="dolibarr-install.html#toc1.5">Dolibarr</A>
</H2>

<P>Cr&eacute;er un r&eacute;pertoire appel&eacute; document dans le r&eacute;pertoire htdocs des sources et affectez les droits d'&eacute;criture dans ce r&eacute;pertoire &agrave; l'utilisateur ex&eacute;cutant le serveur web.</P>
<P>Cr&eacute;er un fichier conf/conf.php et donnez les droits d'&eacute;criture dans ce fichier &agrave; l'utilisateur ex&eacute;cutant le serveur web.</P>
<P>Pour configurer Dolibarr acc&eacute;dez &agrave; la page
<BLOCKQUOTE><CODE>
<PRE>
/install.php
</PRE>
</CODE></BLOCKQUOTE>
, pour vous logger utlisez
le login <B>admin</B> avec le mot de passe <B>admin</B>.</P>
<P>Si les contr&ocirc;les sont corrects
vous n'avez qu'&agrave; cliquer sur le lien, 'Configurer les modules'.</P>
<P>Une fois les modules configur&eacute;s il ne reste plus qu'&agrave; d&eacute;finir les
utilisateurs et leurs permissions respectives. Pour cela cliquer sur
Accueil -> Utilisateurs</P>
<P>Il est fortement conseill&eacute; de supprimer le fichier install.php une fois l'installation termin&eacute;e. De m&ecirc;me pensez &agrave; modifier le mot de passe de l'utilisateur admin.</P>
<HR>
<A HREF="dolibarr-install-2.html">Page suivante</A>
Page précédente
<A HREF="dolibarr-install.html#toc1">Table des matières</A>
</BODY>
</HTML>
