Repository: Dolibarr/dolibarr
Catalog: htdocs/includes/symfony/validator/Resources/translations/validators.*.xlf
Languages: sr_latn

source: This value should be false.
sr_latn: Vrednost bi trebalo da bude netačna.

source: This value should be true.
sr_latn: Vrednost bi trebalo da bude tačna.

source: This value should be of type {{ type }}.
sr_latn: Vrednost bi trebalo da bude tipa {{ type }}.

source: This value should be blank.
sr_latn: Vrednost bi trebalo da bude prazna.

source: The value you selected is not a valid choice.
sr_latn: Odabrana vrednost nije validan izbor.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
sr_latn: Morate odabrati bar {{ limit }} mogućnost.|Morate odabrati bar {{ limit }} mogućnosti.|Morate odabrati bar {{ limit }} mogućnosti.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
sr_latn: Morate odabrati najviše {{ limit }} mogućnost.|Morate odabrati najviše {{ limit }} mogućnosti.|Morate odabrati najviše {{ limit }} mogućnosti.

source: One or more of the given values is invalid.
sr_latn: Jedna ili više vrednosti nisu validne.

source: This field was not expected.
sr_latn: Ovo polje nije bilo očekivano.

source: This field is missing.
sr_latn: Ovo polje nedostaje.

source: This value is not a valid date.
sr_latn: Vrednost nije validan datum.

source: This value is not a valid datetime.
sr_latn: Vrednost nije validno vreme.

source: This value is not a valid email address.
sr_latn: Vrednost nije validna adresa elektronske pošte.

source: The file could not be found.
sr_latn: Datoteka ne može biti pronađena.

source: The file is not readable.
sr_latn: Datoteka nije čitljiva.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
sr_latn: Datoteka je prevelika ({{ size }} {{ suffix }}). Najveća dozvoljena veličina je {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
sr_latn: MIME tip datoteke nije validan ({{ type }}). Dozvoljeni MIME tipovi su {{ types }}.

source: This value should be {{ limit }} or less.
sr_latn: Vrednost bi trebalo da bude {{ limit }} ili manje.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
sr_latn: Vrednost je predugačka. Trebalo bi da ima {{ limit }} karakter ili manje.|Vrednost je predugačka. Trebalo bi da ima {{ limit }} karaktera ili manje.|Vrednost je predugačka. Trebalo bi da ima {{ limit }} karaktera ili manje.

source: This value should be {{ limit }} or more.
sr_latn: Vrednost bi trebalo da bude {{ limit }} ili više.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
sr_latn: Vrednost je prekratka. Trebalo bi da ima {{ limit }} karakter ili više.|Vrednost je prekratka. Trebalo bi da ima {{ limit }} karaktera ili više.|Vrednost je prekratka. Trebalo bi da ima {{ limit }} karaktera ili više.

source: This value should not be blank.
sr_latn: Vrednost ne bi trebalo da bude prazna.

source: This value should not be null.
sr_latn: Vrednost ne bi trebalo da bude prazna.

source: This value should be null.
sr_latn: Vrednost bi trebalo da bude prazna.

source: This value is not valid.
sr_latn: Vrednost nije validna.

source: This value is not a valid time.
sr_latn: Vrednost nije validno vreme.

source: This value is not a valid URL.
sr_latn: Vrednost nije validan URL.

source: The two values should be equal.
sr_latn: Obe vrednosti bi trebalo da budu jednake.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
sr_latn: Datoteka je prevelika. Najveća dozvoljena veličina je {{ limit }} {{ suffix }}.

source: The file is too large.
sr_latn: Datoteka je prevelika.

source: The file could not be uploaded.
sr_latn: Datoteka ne može biti otpremljena.

source: This value should be a valid number.
sr_latn: Vrednost bi trebalo da bude validan broj.

source: This file is not a valid image.
sr_latn: Ova datoteka nije validna slika.

source: This is not a valid IP address.
sr_latn: Ovo nije validna IP adresa.

source: This value is not a valid language.
sr_latn: Vrednost nije validan jezik.

source: This value is not a valid locale.
sr_latn: Vrednost nije validna međunarodna oznaka jezika.

source: This value is not a valid country.
sr_latn: Vrednost nije validna država.

source: This value is already used.
sr_latn: Vrednost je već iskorišćena.

source: The size of the image could not be detected.
sr_latn: Veličina slike ne može biti određena.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
sr_latn: Širina slike je prevelika ({{ width }} piksela). Najveća dozvoljena širina je {{ max_width }} piksela.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
sr_latn: Širina slike je premala ({{ width }} piksela). Najmanja dozvoljena širina je {{ min_width }} piksela.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
sr_latn: Visina slike je prevelika ({{ height }} piksela). Najveća dozvoljena visina je {{ max_height }} piksela.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
sr_latn: Visina slike je premala ({{ height }} piksela). Najmanja dozvoljena visina je {{ min_height }} piksela.

source: This value should be the user's current password.
sr_latn: Vrednost bi trebalo da bude trenutna korisnička lozinka.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
sr_latn: Vrednost bi trebalo da ima tačno {{ limit }} karakter.|Vrednost bi trebalo da ima tačno {{ limit }} karaktera.|Vrednost bi trebalo da ima tačno {{ limit }} karaktera.

source: The file was only partially uploaded.
sr_latn: Datoteka je samo parcijalno otpremljena.

source: No file was uploaded.
sr_latn: Datoteka nije otpremljena.

source: No temporary folder was configured in php.ini.
sr_latn: Privremeni direktorijum nije konfigurisan u php.ini.

source: Cannot write temporary file to disk.
sr_latn: Nemoguće pisanje privremene datoteke na disk.

source: A PHP extension caused the upload to fail.
sr_latn: PHP ekstenzija je prouzrokovala neuspeh otpremanja datoteke.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
sr_latn: Ova kolekcija bi trebalo da sadrži {{ limit }} ili više elemenata.|Ova kolekcija bi trebalo da sadrži {{ limit }} ili više elemenata.|Ova kolekcija bi trebalo da sadrži {{ limit }} ili više elemenata.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
sr_latn: Ova kolekcija bi trebalo da sadrži {{ limit }} ili manje elemenata.|Ova kolekcija bi trebalo da sadrži {{ limit }} ili manje elemenata.|Ova kolekcija bi trebalo da sadrži {{ limit }} ili manje elemenata.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
sr_latn: Ova kolekcija bi trebalo da sadrži tačno {{ limit }} element.|Ova kolekcija bi trebalo da sadrži tačno {{ limit }} elementa.|Ova kolekcija bi trebalo da sadrži tačno {{ limit }} elemenata.

source: Invalid card number.
sr_latn: Broj kartice nije validan.

source: Unsupported card type or invalid card number.
sr_latn: Tip kartice nije podržan ili broj kartice nije validan.

source: This is not a valid International Bank Account Number (IBAN).
sr_latn: Ovo nije validan međunarodni broj bankovnog računa (IBAN).

source: This value is not a valid ISBN-10.
sr_latn: Ovo nije validan ISBN-10.

source: This value is not a valid ISBN-13.
sr_latn: Ovo nije validan ISBN-13.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
sr_latn: Ovo nije validan ISBN-10 ili ISBN-13.

source: This value is not a valid ISSN.
sr_latn: Ovo nije validan ISSN.

source: This value is not a valid currency.
sr_latn: Ovo nije validna valuta.

source: This value should be equal to {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude jednaka {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude veća od {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude veća ili jednaka {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude identična sa {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude manja od {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude manja ili jednaka {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
sr_latn: Ova vrednost ne bi trebalo da bude jednaka {{ compared_value }}.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
sr_latn: Ova vrednost ne bi trebalo da bude identična sa {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
sr_latn: Razmera ove slike je prevelika ({{ ratio }}). Maksimalna dozvoljena razmera je {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
sr_latn: Razmera ove slike je premala ({{ ratio }}). Minimalna očekivana razmera je {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
sr_latn: Slika je kvadratna ({{ width }}x{{ height }} piksela). Kvadratne slike nisu dozvoljene.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
sr_latn: Slika je pejzažno orijentisana ({{ width }}x{{ height }} piksela). Pejzažna orijentisane slike nisu dozvoljene.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
sr_latn: Slika je portretno orijentisana ({{ width }}x{{ height }} piksela). Portretno orijentisane slike nisu dozvoljene.

source: An empty file is not allowed.
sr_latn: Prazna datoteka nije dozvoljena.

source: The host could not be resolved.
sr_latn: Ime hosta ne može biti razrešeno.

source: This value does not match the expected {{ charset }} charset.
sr_latn: Vrednost se ne poklapa sa očekivanim {{ charset }} setom karaktera.

source: This is not a valid Business Identifier Code (BIC).
sr_latn: Ovo nije validan BIC.

source: Error
sr_latn: Greška

source: This is not a valid UUID.
sr_latn: Ovo nije validan univerzalni unikatni identifikator (UUID).

source: This value should be a multiple of {{ compared_value }}.
sr_latn: Ova vrednost bi trebalo da bude deljiva sa {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
sr_latn: BIC kod nije povezan sa IBAN {{ iban }}.

source: This value should be valid JSON.
sr_latn: Ova vrednost bi trebalo da bude validan JSON.

source: This collection should contain only unique elements.
sr_latn: Ova kolekcija bi trebala da sadrži samo jedinstvene elemente.

source: This value should be positive.
sr_latn: Ova vrednost bi trebala biti pozitivna.

source: This value should be either positive or zero.
sr_latn: Ova vrednost bi trebala biti pozitivna ili nula.

source: This value should be negative.
sr_latn: Ova vrednost bi trebala biti negativna.

source: This value should be either negative or zero.
sr_latn: Ova vrednost bi trebala biti negativna ili nula.

source: This value is not a valid timezone.
sr_latn: Ova vrednost nije validna vremenska zona.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
sr_latn: Ova lozinka je kompromitovana prilikom prethodnih napada, nemojte je koristiti. Koristite drugu lozinku.

source: This value should be between {{ min }} and {{ max }}.
sr_latn: Ova vrednost treba da bude između {{ min }} i {{ max }}.

source: This value is not a valid hostname.
sr_latn: Ova vrednost nije ispravno ime poslužitelja (hostname).

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
sr_latn: Broj elemenata u ovoj kolekciji bi trebalo da bude deljiv sa {{ compared_value }}.

source: This value should satisfy at least one of the following constraints:
sr_latn: Ova vrednost bi trebalo da zadovoljava namjanje jedno od narednih ograničenja:

source: Each element of this collection should satisfy its own set of constraints.
sr_latn: Svaki element ove kolekcije bi trebalo da zadovolji sopstveni skup ograničenja.

source: This value is not a valid International Securities Identification Number (ISIN).
sr_latn: Ova vrednost nije ispravna međunarodna identifikaciona oznaka hartija od vrednosti (ISIN).

source: This value should be a valid expression.
sr_latn: Ova vrednost treba da bude validan izraz.

source: This value is not a valid CSS color.
sr_latn: Ova vrednost nije ispravna CSS boja.

source: This value is not a valid CIDR notation.
sr_latn: Ova vrednost nije ispravna CIDR notacija.

source: The value of the netmask should be between {{ min }} and {{ max }}.
sr_latn: Vrednost mrežne maske treba biti između {{ min }} i {{ max }}.
